tutorials/compressible/nexaFoam/neTCLib/HEGCylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $velocityValue;
    }

    cylinder
    {
        type            noSlip;
    }

    over
    {
        type            empty;
    }

    under
    {
        type            empty;
    }

    outlet
    {
        type            zeroGradient;
    }

	symmBC
	{
		type			symmetry;
	}
}


// ************************************************************************* //
