tutorials/compressible/nexaFoam/neTCLib/HEGCylinder/0/Y_O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Y_O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "initialConditions"

dimensions      [0 0 0 0 0 0 0];

internalField   uniform $O2_mass_fraction;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $O2_mass_fraction;
    }

    cylinder
    {
        type            zeroGradient;
    }

    over
    {
        type            empty;
    }

    under
    {
        type            empty;
    }

    outlet
    {
        type            zeroGradient;
    }

	symmBC
	{
		type			symmetry;
	}
}


// ************************************************************************* //
